////
//// This file presents the default configuration used by both the `zenoh-plugin-dds` plugin and the `zenoh-bridge-dds` standalone executable.
//// The "dds" JSON5 object below can be used as such in the "plugins" part of a config file for the zenoh router (zenohd).
////
{
  plugins: {
    ////
    //// DDS related configuration
    //// All settings are optional and are unset by default - uncomment the ones you want to set
    ////
    dds: {
      ////
      //// scope: A string added as prefix to all routed DDS topics when mapped to a zenoh resource.
      ////        This should be used to avoid conflicts when several distinct DDS systems using
      ////        the same topics names are routed via zenoh.
      ////
      // scope: "robot-1",

      ////
      //// domain: The DDS Domain ID. By default set to 0, or to "$ROS_DOMAIN_ID" is this environment variable is defined.
      ////
      // domain: 0,

      ////
      //// localhost_only: If set to true, the DDS discovery and traffic will occur only on the localhost interface (127.0.0.1).
      ////                 By default set to false, unless the "ROS_LOCALHOST_ONLY=1" environment variable is defined.
      ////
      // localhost_only: true,

      ////
      //// group_member_id: A custom identifier for the bridge, that will be used in group management
      ////                  (if not specified, the zenoh UUID is used).
      ////
      // group_member_id: "robot-1",

      ////
      //// allow: 1 or more regular expression matching the set of 'partition/topic-name' that must be routed via zenoh.
      ////        By default, all partitions and topics are allowed.
      ////        If both 'allow' and 'deny' are set a partition and/or topic will be allowed if it matches only the 'allow' expression.
      ////        Repeat this option to configure several topic expressions. These expressions are concatenated with '|'.
      ////        Examples (the last 2 are equivalent):
      ////           allow: ".*/TopicA",
      ////           allow: "Partition-?/.*",
      ////           allow: ["cmd_vel", "rosout"]
      ////           allow: "cmd_vel|rosout"
      ////
      // allow: ["cmd_vel", "rosout"],

      ////
      //// deny:  1 or more regular regular expression matching the set of 'partition/topic-name' that must NOT be routed via zenoh.
      ////        By default, no partitions and no topics are denied.
      ////        If both 'allow' and 'deny' are set a partition and/or topic will be allowed if it matches only the 'allow' expression.
      ////        Repeat this option to configure several topic expressions. These expressions are concatenated with '|'.
      ////        Examples (the last 2 are equivalent):
      ////           deny: ".*/TopicA",
      ////           deny: "Partition-?/.*",
      ////           deny: ["cmd_vel", "rosout"]
      ////           allow: "cmd_vel|rosout"
      ////
      // deny: ["cmd_vel", "rosout"],

      ////
      //// max_frequencies: Specifies a list of maximum frequency of data routing over zenoh for a set of topics.
      ////                  The strings must have the format "<regex>=<float>":
      ////                  - "regex" is a regular expression matching the set of "partition/topic-name"
      ////                    (same syntax than --allow option) for which the data (per DDS instance) must be
      ////                    routed at no higher rate than the specified max frequency.
      ////                  - "float" is the maximum frequency in Hertz;
      ////                    if publication rate is higher, downsampling will occur when routing.
      // max_frequencies: ["diagnostic.*=10", "rosout=5"],

      ////
      //// generalise_subs: A list of key expression to use for generalising subscriptions.
      ////
      // generalise_subs: ["SUB1", "SUB2"],

      ////
      //// generalise_subs: A list of key expression to use for generalising publications.
      ////
      // generalise_subs: ["PUB1", "PUB2"],

      ////
      //// forward_discovery: When true, rather than creating a local route when discovering a local DDS entity,
      ////                    this discovery info is forwarded to the remote plugins/bridges.
      ////                    Those will create the routes, including a replica of the discovered entity.
      ////
      // forward_discovery: false,

      ////
      //// reliable_routes_blocking: When true, the publications from a RELIABLE DDS Writer will be
      ////                           routed to zenoh using the CongestionControl::Block option.
      ////                           Meaning the routing will be blocked in case of network congestion,
      ////                           blocking the DDS Reader and the RELIABLE DDS Writer in return.
      ////                           When false (or for BERST_EFFORT DDS Writers), CongestionControl::Drop
      ////                           is used, meaning the route might drop some data in case of congestion.
      ////
      // reliable_routes_blocking: true,

      ////
      //// queries_timeout: A duration in seconds (default: 5.0 sec) that will be used as a timeout when the bridge
      ////                  queries any other remote bridge for discovery information and for historical data for TRANSIENT_LOCAL DDS Readers it serves
      ////                  (i.e. if the query to the remote bridge exceed the timeout, some historical samples might be not routed to the Readers,
      ////                  but the route will not be blocked forever).
      ////
      // queries_timeout: 5.0,
    },

    ////
    //// REST API configuration (active only if this part is defined)
    ////
    // rest: {
    //   ////
    //   //// The HTTP port number (for all network interfaces).
    //   //// You can bind on a specific interface setting a "<local_ip>:<port>" string.
    //   ////
    //   http_port: 8000,
    // },
  },

  ////
  //// zenoh related configuration (see zenoh documentation for more details)
  ////

  ////
  //// id: The identifier (as hex-string) that zenoh-bridge-dds must use. If not set, a random UUIDv4 will be used.
  //// WARNING: this id must be unique in your zenoh network.
  // id: "A00001",

  ////
  //// mode: The bridge's mode (peer or client)
  ////
  //mode: "client",

  ////
  //// Which endpoints to connect to. E.g. tcp/localhost:7447.
  //// By configuring the endpoints, it is possible to tell zenoh which router/peer to connect to at startup.
  ////
  connect: {
    endpoints: [
      // "<proto>/<ip>:<port>"
    ]
  },

  ////
  //// Which endpoints to listen on. E.g. tcp/localhost:7447.
  //// By configuring the endpoints, it is possible to tell zenoh which are the endpoints that other routers, 
  //// peers, or client can use to establish a zenoh session.
  ////
  listen: {
    endpoints: [
      // "<proto>/<ip>:<port>"
    ]
  },
}
